-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Feb 01, 2020 at 09:46 AM
-- Server version: 5.7.26
-- PHP Version: 7.3.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `restaurant`
--

-- --------------------------------------------------------

--
-- Table structure for table `chuan`
--

CREATE TABLE `chuan` (
  `restaurant_name` varchar(12) DEFAULT NULL,
  `pronunciation` varchar(56) DEFAULT NULL,
  `city` varchar(11) DEFAULT NULL,
  `per_capita_consumption` varchar(7) DEFAULT NULL,
  `rating (out of 5)` decimal(3,2) DEFAULT NULL,
  `address` varchar(33) DEFAULT NULL,
  `opening_hour` varchar(28) DEFAULT NULL,
  `telephone_number` varchar(14) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `chuan`
--

INSERT INTO `chuan` (`restaurant_name`, `pronunciation`, `city`, `per_capita_consumption`, `rating (out of 5)`, `address`, `opening_hour`, `telephone_number`) VALUES
('红巷子 · 川菜', 'hóng xiàng zǐ chuān cài ', 'Beijing 北京', '¥157.00', '4.89', '东直门内大街288-1-1号', '11:00 - 14:00, 17:00 - 01:00', '010-64022998'),
('锦府盐帮·李宅', 'jǐn fǔ yán bāng lǐ zhái ', 'Beijing 北京', '¥122.00', '4.91', '丹棱街甲1号欧美汇购物中心6层', '11:00 - 14:30, 16:30 - 21:30', '010-82887182'),
('红辣椒', 'hóng là jiāo ', 'Beijing 北京', '¥124.00', '4.95', '朝外外交部南街联合大厦5层', '10:30 - 02:00', '010-85728663'),
('滋色菇娘鱼', 'zī sè gū niáng yú ', 'Beijing 北京', '¥152.00', '4.88', '煤市街与廊坊头条交叉口东北角北京坊西区8号楼3层', '11:00 - 22:00', '010-83169688'),
('温江老字号鸡毛店', 'wēn jiāng lǎo zì hào jī máo diàn ', 'Chengdu 成都', '¥66.00', '4.87', '二环路北四段9号高车一路汇融名城D区', '11:00 - 15:00, 16:30 - 21:00', '18121866618'),
('子月餐厅', 'zǐ yuè cān tīng ', 'Chengdu 成都', '¥536.00', '4.90', '桂溪路60号安琪儿月子酒店2楼', '11:30 - 22:00', '028-61961997'),
('陶德砂锅', 'táo dé shā guō ', 'Chengdu 成都', '¥56.00', '4.89', '蜀汉路494号附2号', '10:30 - 14:30, 17:00 - 22:30', '028-83518889'),
('冯四女上跷脚牛肉百年传承', 'féng sì nǚ shàng qiāo jiǎo niú ròu bǎi nián chuán chéng ', 'Leshan 乐山', '¥38.00', '4.82', '嘉兴路289号美食街', '09:30 - 20:30', '0833-2372777'),
('汤牛汤跷脚牛肉总店', 'tāng niú tāng qiāo jiǎo niú ròu zǒng diàn ', 'Leshan 乐山', '¥43.00', '4.85', '演武街19号', '10:30 - 21:30', '15082213330'),
('胃笑·开水鸡钵钵鸡店', 'wèi xiào kāi shuǐ jī bō bō jī diàn ', 'Leshan 乐山', '¥45.00', '4.84', '嘉祥路30号', '09:00 - 21:30', '15983351964'),
('本甄精品川菜', 'běn zhēn jīng pǐn chuān cài ', 'Shanghai 上海', '¥149.00', '4.92', '湖滨路150号湖滨道购物中心3楼', '11:00 - 14:30, 16:30 - 21:30', '021-53865196'),
('映水芙蓉', 'yìng shuǐ fú róng ', 'Shanghai 上海', '¥167.00', '4.87', '淮海中路918号7层', '10:30 - 14:00, 16:30 - 22:00', '(400) 100-1717'),
('天辣', 'tiān là ', 'Shanghai 上海', '¥105.00', '4.92', '徐家汇路618号日月光广场4楼', '11:00 - 14:00, 16:30 - 21:30', '021-64377797'),
('鸡毛店·成都江湖菜馆', 'jī máo diàn chéng dōu jiāng hú cài guǎn ', 'Shanghai 上海', '¥89.00', '4.54', '行知路299号', '10:30 - 02:00', '021-66770357'),
('禄鼎记', 'lù dǐng jì ', 'Shenzhen 深圳', '¥95.00', '4.91', '福华路346号卓悦中心L2层L231、L232号铺', '11:30 - 14:30, 17:00 - 21:30', '0755-25511636'),
('渝辣蜀都', 'yú là shǔ dōu ', 'Shenzhen 深圳', '¥65.00', '4.84', '梅林街道上梅社区梅林路89号鸿运大楼1栋a109商铺', '10:30 - 14:00, 16:00 - 01:00', '0755-82529006'),
('马旺子川小馆', 'mǎ wàng zǐ chuān xiǎo guǎn ', 'Shenzhen 深圳', '¥135.00', '4.75', '科院南路深圳湾万象城1区2楼L246', '11:30 - 14:30, 17:00 - 20:30', '0755-86181923'),
('巴蜀风', 'bā shǔ fēng', 'Shenzhen 深圳', '¥82.00', '4.84', '五和大道星河WORLD.COCOPark购物中心B1C-002号铺', '11:00 - 14:00, 17:00 - 22:00', '0755-86178009'),
('兔行天下鸿鹤鲜锅兔', 'tù háng tiān xià hóng hè xiān guō tù ', 'Zigong 自贡', '¥74.00', '4.33', '汇东路373号', '09:00 - 22:00', '0813-8212201'),
('光大老街兔', 'guāng dà lǎo jiē tù', 'Zigong 自贡', '¥70.00', '4.87', '三八路华西蜀光茗居底商', '09:30 - 20:30', '0813-2703333'),
('红巷子 · 川菜', 'hóng xiàng zǐ chuān cài ', 'Beijing 北京', '¥157.00', '4.89', '东直门内大街288-1-1号', '11:00 - 14:00, 17:00 - 01:00', '010-64022998'),
('锦府盐帮·李宅', 'jǐn fǔ yán bāng lǐ zhái ', 'Beijing 北京', '¥122.00', '4.91', '丹棱街甲1号欧美汇购物中心6层', '11:00 - 14:30, 16:30 - 21:30', '010-82887182'),
('红辣椒', 'hóng là jiāo ', 'Beijing 北京', '¥124.00', '4.95', '朝外外交部南街联合大厦5层', '10:30 - 02:00', '010-85728663'),
('滋色菇娘鱼', 'zī sè gū niáng yú ', 'Beijing 北京', '¥152.00', '4.88', '煤市街与廊坊头条交叉口东北角北京坊西区8号楼3层', '11:00 - 22:00', '010-83169688'),
('温江老字号鸡毛店', 'wēn jiāng lǎo zì hào jī máo diàn ', 'Chengdu 成都', '¥66.00', '4.87', '二环路北四段9号高车一路汇融名城D区', '11:00 - 15:00, 16:30 - 21:00', '18121866618'),
('子月餐厅', 'zǐ yuè cān tīng ', 'Chengdu 成都', '¥536.00', '4.90', '桂溪路60号安琪儿月子酒店2楼', '11:30 - 22:00', '028-61961997'),
('陶德砂锅', 'táo dé shā guō ', 'Chengdu 成都', '¥56.00', '4.89', '蜀汉路494号附2号', '10:30 - 14:30, 17:00 - 22:30', '028-83518889'),
('冯四女上跷脚牛肉百年传承', 'féng sì nǚ shàng qiāo jiǎo niú ròu bǎi nián chuán chéng ', 'Leshan 乐山', '¥38.00', '4.82', '嘉兴路289号美食街', '09:30 - 20:30', '0833-2372777'),
('汤牛汤跷脚牛肉总店', 'tāng niú tāng qiāo jiǎo niú ròu zǒng diàn ', 'Leshan 乐山', '¥43.00', '4.85', '演武街19号', '10:30 - 21:30', '15082213330'),
('胃笑·开水鸡钵钵鸡店', 'wèi xiào kāi shuǐ jī bō bō jī diàn ', 'Leshan 乐山', '¥45.00', '4.84', '嘉祥路30号', '09:00 - 21:30', '15983351964'),
('本甄精品川菜', 'běn zhēn jīng pǐn chuān cài ', 'Shanghai 上海', '¥149.00', '4.92', '湖滨路150号湖滨道购物中心3楼', '11:00 - 14:30, 16:30 - 21:30', '021-53865196'),
('映水芙蓉', 'yìng shuǐ fú róng ', 'Shanghai 上海', '¥167.00', '4.87', '淮海中路918号7层', '10:30 - 14:00, 16:30 - 22:00', '(400) 100-1717'),
('天辣', 'tiān là ', 'Shanghai 上海', '¥105.00', '4.92', '徐家汇路618号日月光广场4楼', '11:00 - 14:00, 16:30 - 21:30', '021-64377797'),
('鸡毛店·成都江湖菜馆', 'jī máo diàn chéng dōu jiāng hú cài guǎn ', 'Shanghai 上海', '¥89.00', '4.54', '行知路299号', '10:30 - 02:00', '021-66770357'),
('禄鼎记', 'lù dǐng jì ', 'Shenzhen 深圳', '¥95.00', '4.91', '福华路346号卓悦中心L2层L231、L232号铺', '11:30 - 14:30, 17:00 - 21:30', '0755-25511636'),
('渝辣蜀都', 'yú là shǔ dōu ', 'Shenzhen 深圳', '¥65.00', '4.84', '梅林街道上梅社区梅林路89号鸿运大楼1栋a109商铺', '10:30 - 14:00, 16:00 - 01:00', '0755-82529006'),
('马旺子川小馆', 'mǎ wàng zǐ chuān xiǎo guǎn ', 'Shenzhen 深圳', '¥135.00', '4.75', '科院南路深圳湾万象城1区2楼L246', '11:30 - 14:30, 17:00 - 20:30', '0755-86181923'),
('巴蜀风', 'bā shǔ fēng', 'Shenzhen 深圳', '¥82.00', '4.84', '五和大道星河WORLD.COCOPark购物中心B1C-002号铺', '11:00 - 14:00, 17:00 - 22:00', '0755-86178009'),
('兔行天下鸿鹤鲜锅兔', 'tù háng tiān xià hóng hè xiān guō tù ', 'Zigong 自贡', '¥74.00', '4.33', '汇东路373号', '09:00 - 22:00', '0813-8212201'),
('光大老街兔', 'guāng dà lǎo jiē tù', 'Zigong 自贡', '¥70.00', '4.87', '三八路华西蜀光茗居底商', '09:30 - 20:30', '0813-2703333');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
